students = (
    ("Николай", 28, 8, "Киев"),
    ("Оксана", 30, 9, "Киев"),
    ("Дмитрий", 25, 5.5, "Харьков"),
    ("Петр", 22, 4.1, "Одесса"),
    ("Иван", 27, 8.7, "Киев"),
    ("Екатерина", 21, 2.8, "Львов"),
    ("Елизавета", 23, 10, "Винница")
    )
# расчет среднего балла
sum_of_mark = 0
for i in students:
    sum_of_mark += i[2]

avg_mark = sum_of_mark/len(students)

# создание списка студентов с оценкой выше среднего
std_names = " "
for i in students:
    if i[2] >= avg_mark:
        std_names += i[0] + ", "

print(f"Ученики {std_names} в этом семестре хорошо учатся!")
