year = int(input("Введите год от 1900 до 1000000: "))
if 1900 < year < 1000000:
    if year % 4 == 0:
        if year % 100 != 0:
            print("Високосный")
        elif year % 100 == 0:
            if year % 400 == 0:
                print("Високосный")
            else:
                print("Не високосный")
else:
    print("Ошибка. Введите год соответствующий требованиям!")
# Ниже -  попытка сделать код короче
# year = int(input("Введите год от 1900 до 1000000: "))
# if 1900 < year < 1000000:
#     if (year % 4 == 0) and (year % 100 != 0) or (year % 400 == 0):
#         print("Високосный год")
#     else:
#         print("Не високосный год")
# else:
#     print("Ошибка. Введите год соответствующий требованиям!")
