"""
Этот модуль содержит три шутки-каламбура
"""
__all__ = ["joke1", "joke2", "joke3"]


def joke1():
    """ Выводит шутку №1
    """
    print("Что сделал мужик который обьелся дрожжей в лесу? \n")
    input("Жми пробел и Enter \n")
    print("Ходит-бродит")


def joke2():
    """ Выводит шутку №2
    """
    print("Что произошло, после того, как пациенту "
          "вместо правой ноги прикрепили колесо? \n")
    input("Жми пробел и Enter \n")
    print("Пошло-поехало")


def joke3():
    """ Выводит шутку №3
    """
    print("Как называют человека который усыновил булку? \n")
    input("Жми пробел и Enter \n")
    print("Опекарь")
