import random
# Программа загадывает число
num_for_guess = random.choice(range(1, 101))

attempt = 0        # Счетчик попыток
user_input = 0     # Переменная пользовательского ввода

# Цикл длится до тех пор пока ввод пользователя не будет равен заранее загаданному числу
while int(user_input) != num_for_guess:
    user_input = input("Отгадай число в диапазоне от 1 до 100: ")

# Проверка на соответствие ввода нужным параметрам
    if user_input.isdigit() and int(user_input) <= 100:
        attempt += 1

# Вывод информации о том, введеное число больше или меньше.
        if int(user_input) < num_for_guess:
            print(f"Попытка № {attempt}. Ваше число меньше загаданного, попробуйте еще раз")
        elif int(user_input) > num_for_guess:
            print(f"Попытка № {attempt}. Ваше число больше загаданного, попробуйте еще раз")

# Сообщение если ввод содержит букві или цифру больше 100
    else:
        print("Введено неправильное значение")

# Сообщение при завершении цикла
print(f"Верно! ты угадал с {attempt} раза")
